app/controllers/movies_controller.rb

  def index
    @movies = Movie.find(:all, :order => (params[:sort]))
    if params[:ratings]
      @movies = Movie.where(rating: params[:ratings].keys).find(:all, :order => (params[:sort]))
    end
    @sort_by = params[:sort]
    @all_ratings = Movie.all_ratings
    @ratings = params[:ratings]
    if params[:ratings].nil?
      @ratings = Hash.new
      @all_ratings.each do |value|
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", :rating]]
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R') ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY release_date

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)